Revit 2026 API

# DocumentClosedEventArgs Class

---

The event arguments used by the DocumentClosed event.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPIPostEventArgs Autodesk.Revit.DB.EventsDocumentClosedEventArgs

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DocumentClosedEventArgs : RevitAPIPostEventArgs
```
```vb
Public Class DocumentClosedEventArgs
	Inherits RevitAPIPostEventArgs
```
```cpp
public ref class DocumentClosedEventArgs : public RevitAPIPostEventArgs
```
```fsharp
type DocumentClosedEventArgs =
    class
        inherit RevitAPIPostEventArgs
    end
```

The DocumentClosedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | DocumentId | Id of the document that has just been closed. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | Status | Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler). (Inherited from RevitAPIPostEventArgs) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Events Namespace